#ΑΣΚΗΣΗ 9
#.Γράψτε ένα πρόγραμμα σε Python το οποίο παίρνει έναν αριθμό τον τριπλασιάζει,
#προσθέτει ένα και στην συνέχεια προσθέτει τα ψηφία του.
#Η διαδικασία επαναμβάνεται μέχρι ο αριθμός να γίνει μονοψήφιος

number = abs(int(input("Εισάγεται αριθμό: ")))

flag = False
while (flag == False):
    number= number *3 #πολλαπλασιασμος αριθμου επι 3
    number= number + 1 #προσθεση +1 στον αριθμο
    
    Sum=0 #αρχικοποίηση αθροιστή στο 0
    while(number>0): # εαν ο αριθμος ειναι μεγαλυτερος του 0
        dig=number%10 # παρε το τελευταιο ψηφίο
        Sum=Sum+dig # και προσθεσετο στον αθροιστη
        number=number//10  # μικρύνε τον αριθμο κατα ενα ψηφιο λιγότερο απο δεξιά
        
    if Sum <=9:
        flag = True
        print ("Ο αριθμος μετα την τελικη επεξεργασία: ", Sum)
    else:
        number = Sum # επαναφορά του αριθμου στο τελευταιο αθροισμα για συνεχεια επεξεργασιας
